# FInLayer

## Description
Function FInLayer returns a handle to the first object within the referenced layer. If the layer is empty, the function returns NIL.

```pascal
FUNCTION FInLayer(h : HANDLE): HANDLE;
```

```python
def vs.FInLayer(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from All Versions

## Category
* Document List Handling